<template>
  <div class="column gap-5">
    <q-img style="max-width: 700px" src="~assets/paymentServices.png" />
    <div>
      Оплатить заказ можно с помощью банковских карт платёжных систем Visa,
      MasterCard, МИР. При оплате банковской картой безопасность платежей
      гарантирует процессинговый центр Best2Pay.
    </div>
    <div>
      Приём платежей происходит через защищённое безопасное соединение,
      используя протокол TLS 1.2. Компания Best2Pay соответствует международным
      требованиями PCI DSS для обеспечения безопасной обработки реквизитов
      банковской карты плательщика. Ваши конфиденциальные данные необходимые для
      оплаты (реквизиты карты, регистрационные данные и др.) не поступают в
      Интернет-магазин, их обработка производится на стороне процессингового
      центра Best2Pay и полностью защищена. Никто, в том числе интернет-магазин
      loyalhub.ru, не может получить банковские и персональные данные
      плательщика.
    </div>
    <div>
      При оплате заказа банковской картой возврат денежных средств производится
      на ту же самую карту, с которой был произведён платёж.
    </div>
  </div>
</template>
<script lang="ts" setup></script>
