<template>
  <div
    v-if="!!info && !loading"
    class="px-xl-35 px-sm-20 px-xs-5 px-md-25 px-lg-30 pb-20"
  >
    <div class="row mb-sm-4">
      <div class="col">
        <h4 class="mb-20">
          <strong>Публичная оферта</strong>
        </h4>
        <div v-if="info.legal_entities.length > 1" class="column mb-15 ">
          <div class="body mb-5">Выберите юр.лицо</div>
          <div class="row gap-10 no-wrap overflow-auto full-width">
            <CButton v-for="item in info.legal_entities" :key="item.uuid"
                     :color="item.uuid === selectedLegalEntity?.uuid ? 'selected-company' : 'secondary1'"
                     :hover-text-color="item.uuid === selectedLegalEntity?.uuid ? 'white' : 'black'"
                     :label="item.name"
                     :text-color="item.uuid === selectedLegalEntity?.uuid ? 'white' : 'black'"
                     @click="selectedLegalEntity = item">
            </CButton>
          </div>
        </div>
      </div>
    </div>
    <div class="column gap-15">
      <div class="row">
        <div class="column gap-5">
          <h6 class="mt-0 mb-0 bold">1. Общие положения и основные термины</h6>
          <div class="pl-8">
            <p>
              1.1. Продавец - дееспособное юридическое лицо {{ selectedLegalEntity.name }} (ИНН
              {{ selectedLegalEntity.code }}),
              использующее интернет-магазин в целях предпринимательской деятельности на договорных условиях,
              осуществляющие продажу товаров общественного питания.
            </p>
            <p>
              1.2. Интернет-магазин - торговая организация, предназначенная для предоставления покупателю посредством
              сети Интернет сведений, необходимых при совершении покупки, в том числе об ассортименте товаров, ценах,
              продавце, способах и условиях оплаты и доставки, для приема от покупателей посредством сети Интернет
              сообщений о намерении приобрести товары, а также для обеспечения возможности доставки товаров продавцом
              либо его подрядчиком по указанному покупателем адресу либо до пункта самовывоза.
            </p>
            <p>
              1.3. Веб-сайт интернет-магазина (сайт) - принадлежащая интернет-магазину и администрируемая им
              совокупность логически связанных между собой веб-страниц, содержащих данные о товарах и условиях их
              покупки, по адресу {{ host }}. Сайт доступен круглосуточно.
            </p>
            <p>
              1.4. Покупатель - любое дееспособное физическое или юридическое лицо, которое оформило заказ на
              приобретение товара у продавца в установленном раздел 3 Оферты порядке.
            </p>
            <p>
              1.5. Оферта - публичное предложение продавца любому лицу заключить на ее условиях договор купли-продажи
              товара (далее - договор). Оферта является публичной (п. 2 ст. 437 ГК РФ). Оферта вступает в силу с момента
              ее размещения на сайте интернет-магазина в разделе «Правовые документы» и действует до ее отзыва.

              Продавец вправе изменить или отозвать оферту в одностороннем порядке. Все изменения вступают в силу и
              считаются доведенными до сведения покупателя в момент размещения на указанной Интернет-странице. Заказы,
              которые уже оформлены к моменту изменения или отзыва оферты, исполняются на условиях оферты, которая
              действовала на момент их оформления.
            </p>
            <p>
              1.6. Акция - это временное предложение снижения цены на конкретный товар или определенный ассортимент
              товаров при соблюдении определенных условий. Акция проводится по инициативе продавца и действует до её
              отмены. С полными условиями конкретной акции можно ознакомиться во вкладке «Акции». Скидки и акции не
              суммируются.
            </p>
            <p>
              1.7. Заказ - электронная или устная заявка Покупателя на приобретение Продукции из каталога
              интернет-магазина, согласованная Сторонами, принятая и оформленная оператором интернет-магазина.
            </p>
            <p>
              1.8. Продукция - блюда и сопутствующие товары, указанные на Сайте Продавца и доступные для заказа
              Покупателем.
            </p>
            <p>
              1.9. Товар - любой товар, который продавец предлагает к продаже на сайте интернет-магазина с
              наименованиями позиций товара, которые снабжены его описанием (включая цену, сведения об изготовителе и
              др.) и фотоснимками. Ассортимент товара размещен на сайте интернет-магазина по адресу: {{ host }}
            </p>
            <p>
              1.10. Договор - соглашение купли-продажи между Покупателем и интернет-магазином о приобретении Покупателем
              определенной Продукций по определенной цене, с доставкой в согласованные сроки на определенных условиях
              доставки или получения, а также предусматривающий порядок оплаты.
            </p>
            <p>
              1.11. Мобильное приложение – программное обеспечение, установленное на мобильное устройство для
              обеспечения доступа к товарам Продавца для последующего заключения договора.
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">2. Предмет договора</h6>
          <div class="pl-8">
            <p>
              2.1. Продавец обязуется передать в собственность покупателю, а покупатель обязуется оплатить и принять
              Товар, заказанный на условиях оферты в интернет-магазине.
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">3. Порядок заключения договора, оформление заказа</h6>
          <div class="pl-8">
            <p>
              3.1. Акцептом оферты признается момент, когда покупатель оформил заказ товара у продавца. С этого момента
              договор считается заключенным, за исключением продажи на условиях предоплаты согласно п.4.8 Оферты. В
              таком случае моментом акцепта оферты будет считаться внесение предоплаты.
            </p>
            <p>
              3.2. Для оформления заказа покупатель регистрируется на сайте интернет-магазина самостоятельно или его
              регистрирует менеджер интернет-магазина при приеме заказа по телефону. При регистрации создается личный
              кабинет покупателя.
            </p>
            <p>
              3.3. Покупатель может сделать заказ по телефону интернет-магазина в его рабочие часы или самостоятельно на
              его сайте через заполнение формы заказа, перемещением Продукции в «корзину». Заказ можно оформить на любой
              товар из ассортимента на сайте интернет-магазина по адресу: {{ host }}, при его
              наличии.
            </p>
            <p>
              3.4. При оформлении заказа посредством телефонного звонка покупатель сообщает оператору свое имя
              (наименование), контактный телефон и адрес доставки товара, желаемые дату, время и способы доставки,
              способы оплаты заказа. При оформлении заказа посредством интернет-магазина и/или мобильного приложения
              покупатель вносит в форму для заказа свое имя (наименование), контактный телефон и адрес доставки товара,
              желаемые дату, время и способы доставки, способы оплаты заказа. Эти желаемые показатели покупатель
              выбирает с учетом условий оферты, а также территории и временных интервалов доставки, размещенных во
              вкладке «Доставка».
            </p>
            <p>
              3.5. Заказ считается оформленным в момент:

              <ul class="pl-10">
                <li>
                  при заказе в интернет-магазине и /или мобильном приложении - после нажатия кнопки «Оформить заказ» на
                  последнем этапе оформления заказа и подтверждения заявки «Ваш заказ оформлен!» с получением номера и
                  статуса вашего заказа «Подтвержден»;
                </li>
              </ul>
            </p>
            <p>Для оформления заказа в мобильном приложении Покупателю необходимо указать номер телефона, на который
              будет выслан код для подтверждения оформления Заказа;
              <ul class="pl-10">
                <li>при заказе посредством телефонного звонка - устного подтверждения заказа оператору
                  интернет-магазина.
                  Заказ считается подтвержденным после того, как оператор подтвердил наличие заказанных товаров и
                  стоимость заказа, зафиксировал всю необходимую для доставки информацию и сообщил покупателю о том, что
                  заказ принят.
                </li>
              </ul>
            </p>
            <p>
              3.6. В случае изменения состава Заказа при его обработке службами интернет-магазина его переформирование
              возможно только после согласования с Покупателем его окончательной комплектации.
            </p>
            <p>
              3.7. Оформляя заказ, покупатель подтверждает, что:

              <ul class="pl-10">
                <li>является дееспособным гражданином или уполномоченным на заказ товара представителем юридического
                  лица;
                </li>
                <li>ознакомлен с действующей редакцией оферты и согласен с ее условиями;</li>
                <li>принимает на себя обязательство оплатить заказанный товар и принять его;</li>
                <li>предоставил достоверную информацию при регистрации на сайте интернет-магазина и оформлении заказа;
                </li>
                <li>передает продавцу для обработки в целях заключения и исполнения договора свои персональные данные:
                  имя, номер телефона, дату рождения, адрес электронной почты и доставки товара (для
                  покупателя-гражданина).
                </li>
                <li>дает согласие на обработку переданных персональных данных в целях исполнения договора, участия в
                  акциях, направления ему сообщений рекламного характера, проведения опросов и розыгрышей призов среди
                  покупателей, контроля удовлетворенности покупателя (для покупателя-гражданина). Покупатель вправе
                  отозвать согласие, уведомив продавца письменно по адресу его электронной почты;
                </li>
              </ul>
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">4. Стоимость заказа и его оплата</h6>
          <div class="pl-8">
            <p>
              4.1. Стоимость заказа состоит из цены товара и стоимости его доставки, которые определяет продавец в
              одностороннем порядке. Если продавец изменил цену товара или стоимость доставки после оформления заказа,
              заказ оплачивается по стоимости на момент его оформления.
            </p>
            <p>
              4.2. Цена товара определяется согласно интернет-магазину по адресу: {{ host }}.
            </p>
            <p>
              4.3. Стоимость доставки не входит в цену товара и оплачивается отдельно. Тарифы на доставку с учетом ее
              способа, временных интервалов и территории указаны во вкладке «Доставка» на сайте интернет-магазина по
              адресу: {{ host }}.
            </p>
            <p>
              4.4. Покупатель может оплатить заказ в наличной или безналичной форме.
            </p>
            <p>
              4.5. При расчетах наличными покупатель оплачивает стоимость заказа в момент передачи товара. Продавец
              выдает покупателю кассовый чек.
            </p>
            <p>
              4.6. При безналичной форме оплаты покупатель производит оплату в момент получения Товара, за исключением
              случаев продажи по предоплате, предусмотренных в п.4.7 Оферты.
            </p>
            <p>
              4.6.1. При безналичной форме оплаты в момент оформления Заказа в интернет-магазине покупателю направляется
              электронный кассовый чек на электронную почту, указанную при оформлении заказа или ссылка о его
              местонахождении путем направления смс-сообщения при отсутствии электронной почты.
            </p>
            <p>
              4.7. Обязанность покупателя оплатить заказ считается исполненной в момент внесения полной суммы оплаты в
              кассу или на расчетный счет продавца. Если оплата не поступит в указанный срок, заказ считается
              отмененным, о чем продавец уведомляет покупателя электронным письмом или звонком оператора.
            </p>
            <p>
              4.8. В случае если Покупатель при совершении предыдущих покупок совершил деяния, предусмотренные пунктом
              4.9. настоящего договора, оформление заказа при последующем заключении договора купли-продажи возможно
              исключительно посредством интернет-магазина и/или мобильного приложения с предварительно полной оплаты
              суммы заказа.
            </p>
            <p>
              4.9. Случаями недобросовестного поведения покупателя, в частности, но не ограничиваясь, являются:
              <ul class="pl-10">
                <li>немотивированный отказ от получения и /или оплаты продукции надлежащего качества;</li>
                <li>отказ оплачивать доставленный Товар;</li>
                <li>сообщение покупателем недостоверных данных об адресе доставки, дате рождения (для участия в
                  соответствующей акции);
                </li>
                <li>отказ предоставить документы, подтверждающие действительность данных о дате рождения (для целей
                  получения скидки по соответствующей акции);
                </li>
                <li>неадекватное поведение покупателя (состояние алкогольного опьянения, оскорбление персонала продавца
                  и др.);
                </li>
                <li>однократный отказ от заказа после передачи его курьеру;</li>
                <li>игнорирование звонков операторов после подтверждения заказа;</li>
                <li>если покупатель не открывает дверь курьеру, доставившему Товар.</li>
              </ul>
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">5. Доставка и получение товара</h6>
          <div class="pl-8">
            <p>
              5.1. Доставка Товара осуществляется в согласованные с Покупателем при подтверждении Заказа сроки курьером
              на адрес покупателя или в один из пунктов самовывоза, указанных на сайте интернет-магазина по адресу:
              {{ host }}. Способ доставки (и пункт самовывоза при самовывозе) выбирает покупатель
              при оформлении заказа.
            </p>
            <p>
              5.2. Стоимость доставки рассчитывается индивидуально (исходя из габаритов, региона, формы оплаты и способа
              доставки). Итоговая стоимость доставки Заказа согласовывается с Покупателем посредством телефонного звонка
              оператора интернет-магазина в момент оформления Заказа.
            </p>
            <p>
              5.3. При передаче товара покупатель называет номер заказа/свое имя и номер телефона (подтверждает дату
              рождения документом в случае участия акции в честь дня рождения), проверяет его внешний вид и
              комплектность. Оплачивая заказ, Покупатель подтверждает, что получил Товар и не имеет претензий по его
              внешнему виду, качеству, количеству и комплектности.
            </p>
            <p>
              5.4. Если Покупатель - юридическое лицо, его представитель предъявляет доверенность на получение товара и
              документ, удостоверяющий его личность.
            </p>
            <p>
              5.5. Если доставка Заказа произведена в установленные сроки, но Заказ не был передан Покупателю по его
              вине, последующая доставка производится в новые сроки, согласованные Продавцом с Покупателем.
            </p>
            <p>
              5.6.В случае изменения Покупателем адреса доставки после прибытия курьера на первоначальный адрес,
              указанный Покупателем в Заказе, Покупатель должен оплатить стоимости услуг по доставке Продукции на новый
              адрес по тарифам указанным на сайте интернет-магазина во вкладке «Доставка».
            </p>
            <p>
              5.7. При обнаружении каких-либо нарушений Покупатель вправе отказаться от Заказа или его части, содержащей
              Продукцию ненадлежащего качества, пропорционально оплатив при этом оставшуюся в Заказе Продукцию и услуги
              по его доставке.
            </p>
            <p>
              5.8. Право собственности на Товар переходит к Покупателю в момент фактической передачи ему Товара при
              условии его полной оплаты.
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">6. Изменение заказа и отказ от него</h6>
          <div class="pl-8">
            <p>
              6.1. Если после оформления заказа Продавец выявит отсутствие заказанного товара или его нужного
              количества, то незамедлительно извещает об этом Покупателя по телефону. Покупатель вправе заменить
              отсутствующий товар аналогичным или отказаться от заказа полностью или только в части отсутствующего
              товара.
            </p>
            <p>
              6.2. Покупатель вправе по телефону отказаться от оформленного заказа полностью или в части в любое время
              до его передачи. Оплата за такой заказ (или часть заказа) не производится.
            </p>
            <p>
              6.3. Если покупатель отказывается в предусмотренном п. п. 6.1, 6.2 оферты порядке от предоплаченного
              заказа, продавец возвращает уплаченную за заказ сумму (а в случае частичного отказа - сумму переплаты) на
              те же банковские реквизиты, с которых она поступила продавцу, либо на иные реквизиты, которые покупатель
              письменно сообщит продавцу. Возврат производится в течение 7 (семи) рабочих дней с даты отказа от заказа.
              При этом Покупателю следует учитывать. что из этой суммы продавец вычтет расходы на доставку возвращаемого
              Товара.
            </p>
            <p>
              6.4. По согласованию с продавцом покупатель вправе изменить заказ не позднее чем за 24 часа до начала
              согласованного временного интервала доставки. Если заказ предоплачен, продавец корректирует его стоимость
              и сообщает покупателю сумму, которую необходимо доплатить, либо возвращает переплату на счет покупателя в
              порядке, предусмотренном п. 6.3 оферты.
            </p>
          </div>
        </div>
        <div class="column gap-5 mt-10">
          <h6 class="mt-0 mb-0 bold">7. Прочие положения</h6>
          <div class="pl-8">
            <p>
              7.1. К отношениям между Покупателем и интернет-магазином применяется законодательство Российской
              Федерации.
            </p>
            <p>
              7.2. Все возникающее споры стороны будут стараться решить путем переговоров, при не достижении соглашения
              спор может быть передан на рассмотрение в суд в соответствии с действующим законодательством Российской
              Федерации.
            </p>
            <p>
              7.3. Покупатель (субъект персональных данных) подтверждает, что действует в своей воле и в своем интересе
              и осознает, что вводя код для оформления заказа в соответствующее поле (код приходит в смс-сообщении на
              номер телефона), соглашаясь с условиями публичной оферты, находящимися на сайте, ссылка на который
              содержалась в смс сообщении , полученном при оформлении заказа, данным действием дает согласие (Дата
              получения согласия) на обработку {{ selectedLegalEntity.name }} (а также лицу, осуществляющему обработку
              персональных
              данных по поручению {{ selectedLegalEntity.name }}) своих персональных данных.
            </p>
            <p>
              7.4. Цель обработки персональных данных: заключение и исполнение гражданско-правовых договоров;
              рассмотрение/предъявление претензий, исковых заявлений субъектов персональных данных; исполнение запросов
              по оперативно-розыскной деятельности; с целью обработки, регистрации сведений, необходимых для исполнения
              договора: направления в адрес субъектов – покупателей – специальных предложений; информации о новых
              товарах и рекламных акциях; ответов на запросы; выполнения обязательств перед субъектами как покупателями
              товаров и потребителями услуг.
            </p>
            <p>
              7.5. Перечень персональных данных, на обработку которых дается согласие субъекта персональных данных: ФИО,
              дата рождения, номер телефона, адрес электронной почты.
            </p>
            <p>
              7.6. Перечень действий с персональными данными, на совершение которых дается согласие и используемые
              способы обработки персональных данных: сбор, систематизация, накопление, хранение, уточнение (обновление,
              изменение), распространение (в том числе передача), использование, обезличивание, блокирование,
              уничтожение персональных данных.
            </p>
            <p>
              7.7. {{ selectedLegalEntity.name }} защищает персональную информацию покупателя в соответствии с
              требованиями,
              предъявляемыми к защите такого рода информации. Для защиты персональной информации покупателя, обеспечения
              ее надлежащего использования и предотвращения несанкционированного и/или случайного доступа к ней ИП
              Тронина А.В. применяет необходимые и достаточные технические и административные меры. Предоставляемая
              покупателем персональная информация хранится на серверах с ограниченным доступом, расположенных в
              охраняемых помещениях. В отношении персональной информации покупатель, {{ selectedLegalEntity.name }}
              сохраняет ее
              конфиденциальность.
            </p>
            <p>
              7.8. Обработка персональных данных будет осуществляться путем смешанной обработки с передачей по
              внутренней сети организатора, по сети Интернет.
            </p>
            <p>
              7.9. Срок, в течение которого действует согласие субъекта персональных данных, – до момента отзыва.
            </p>
            <p>
              7.10. Согласие на обработку персональных данных может быть отозвано покупателем путем направления отзыва
              согласия на обработку персональных данных на электронную почту Продавца, указанную на веб-сайте.
            </p>
            <p>
              7.11. {{ selectedLegalEntity.name }} обязуется прекратить обработку или обеспечить прекращение такой
              обработки в срок, не
              превышающий 30 (тридцати дней) с даты поступления заявления на отзыв согласия на обработку персональных
              данных.
            </p>
            <p>
              7.12. При обработке персональных данных пользователей {{ selectedLegalEntity.name }} руководствуется
              Федеральным законом
              РФ «О персональных данных»
            </p>
          </div>
        </div>
      </div>

    </div>
  </div>
  <div v-if="loading" class="absolute-center items-center justify-center flex">
    <q-spinner-puff color="accent1" size="20%" />
  </div>
</template>
<script lang="ts" setup>
import { computed, onMounted, ref } from 'vue'
import { companyGroupRepo } from 'src/models/companyGroup/companyGroupRepo'
import { useRoute } from 'vue-router'
import { LegalEntityRaw, TermsOfServiceInfo } from 'src/models/companyGroup/companyGroup'
import CButton from 'components/template/buttons/CButton.vue'

const host = computed(() => window.location.origin.includes('localhost') ? 'https://loyalhub.ru/' : window.location.origin)

const loading = ref(false)
const route = useRoute()
const info = ref<TermsOfServiceInfo | null>(null)
const selectedLegalEntity = ref<LegalEntityRaw | null>(null)

onMounted(async () => {
  loading.value = true
  info.value = await companyGroupRepo.getTermsOfServiceInfo(
    String(route.params.externalId)
  )
  for (const el of info.value.legal_entities) {
    const name = el.name.toLowerCase().trim()
    if (!name.startsWith('ооо') && !name.startsWith('ип')) {
      if (String(el.code).length === 12) {
        el.name = 'ИП ' + el.name
      }
      if (String(el.code).length === 10) {
        el.name = 'ООО ' + el.name
      }
    }
  }
  selectedLegalEntity.value = info.value.legal_entities.length ? info.value.legal_entities[0] : null
  loading.value = false
})

</script>

<style lang="scss" scoped>
body.screen--xs {
  h4 {
    font-size: 26px !important;
    line-height: 32px;
  }
}

.bg-selected-company {
  background: #6a5ecc
}

</style>
