<template>
  <div v-if="!loader" class="px-5">
    <div id="inputResult">
      <div class="row mb-4">
        <div class="col">
          <h4>
            <strong>Пользовательское соглашение</strong>
          </h4>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>1. Общие положения</h5>
          <div class="ol">
            <div class="li">
              1.1. Настоящее Пользовательское соглашение (далее — Соглашение)
              относится к сайту Интернет-магазина и мобильному приложению "{{
                companyGroupRepo.item?.name
              }}" - далее Сайт
            </div>
            <div class="li">
              1.2. Настоящее Соглашение регулирует отношения между
              Администрацией сайта (далее — Администрация сайта) и Пользователем
              данного Сайта.
            </div>
            <div class="li">
              1.3. Администрация сайта оставляет за собой право в любое время
              изменять, добавлять или удалять пункты настоящего Соглашения без
              уведомления Пользователя.
            </div>
            <div class="li">
              1.4. Продолжение использования Сайта Пользователем означает
              принятие Соглашения и изменений, внесенных в настоящее Соглашение.
            </div>
            <div class="li">
              1.5. Пользователь несет персональную ответственность за проверку
              настоящего Соглашения на наличие изменений в нем.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>2. Определения терминов</h5>
          <div class="ol">
            <div class="li">
              2.1. Перечисленные ниже термины имеют для целей настоящего
              Соглашения следующее значение:
            </div>
            <div class="li">
              2.1.1 «{{ companyGroupRepo.item?.name }}» — осуществляет свою
              деятельность посредством Интернет-ресурса и сопутствующих ему
              сервисов.
            </div>
            <div class="li">
              2.1.2. Интернет-магазин - сайт, содержащий информацию о Товарах,
              Продавце, позволяющий осуществить выбор, заказ и (или)
              приобретение Товара.
            </div>
            <div class="li">
              2.1.3. Администрация сайта Интернет-магазина — уполномоченные
              сотрудники на управления Сайтом, действующие от имени название
              организации.
            </div>
            <div class="li">
              2 1.4. Пользователь сайта Интернет-магазина (далее - Пользователь)
              — лицо, имеющее доступ к Сайту, посредством сети Интернет и
              использующее Сайт.
            </div>
            <div class="li">
              2.1.5. Содержание сайта Интернет-магазина (далее — Содержание) -
              охраняемые результаты интеллектуальной деятельности, включая
              графические, текстовые, фотографические, производные, составные и
              иные произведения, пользовательские интерфейсы, визуальные
              интерфейсы, названия товарных знаков, логотипы, программы для ЭВМ,
              базы данных, а также дизайн, структура, выбор, координация,
              внешний вид, общий стиль и расположение данного Содержания,
              входящего в состав Сайта и другие объекты интеллектуальной
              собственности все вместе и/или по отдельности, содержащиеся на
              сайте Интернет- магазина.
            </div>
            <div class="li">
              2.7. Оператор&nbsp;— государственный орган, муниципальный орган,
              юридическое или физическое лицо, самостоятельно или совместно
              с&nbsp;другими лицами организующие и/или&nbsp;осуществляющие
              обработку персональных данных, а&nbsp;также определяющие цели
              обработки персональных данных, состав персональных данных,
              подлежащих обработке, действия (операции), совершаемые
              с&nbsp;персональными данными.
            </div>
            <div class="li">
              2.8. Персональные данные&nbsp;— любая информация, относящаяся
              прямо или косвенно к&nbsp;определенному или определяемому
              Пользователю сайта.
            </div>
            <div class="li">
              2.9. Персональные данные, разрешенные субъектом персональных
              данных для распространения,&nbsp;— персональные данные, доступ
              неограниченного круга лиц к&nbsp;которым предоставлен субъектом
              персональных данных путем дачи согласия на&nbsp;обработку
              персональных данных, разрешенных субъектом персональных данных для
              распространения в&nbsp;порядке, предусмотренном Законом
              о&nbsp;персональных данных (далее&nbsp;— персональные данные,
              разрешенные для распространения).
            </div>
            <div class="li">
              2.10. Пользователь&nbsp;— любой посетитель сайта
              <!-- <span
                class="link mark owner-site-url-field"
                data-scroll-to="#owner-site-url-field"
                >{{ linkToTerms }}</span
              >. -->
            </div>
            <div class="li">
              2.11. Предоставление персональных данных&nbsp;— действия,
              направленные на&nbsp;раскрытие персональных данных определенному
              лицу или определенному кругу лиц.
            </div>
            <div class="li">
              2.12. Распространение персональных данных&nbsp;— любые действия,
              направленные на&nbsp;раскрытие персональных данных неопределенному
              кругу лиц (передача персональных данных) или на&nbsp;ознакомление
              с&nbsp;персональными данными неограниченного круга лиц, в&nbsp;том
              числе обнародование персональных данных в&nbsp;средствах массовой
              информации, размещение в&nbsp;информационно-телекоммуникационных
              сетях или предоставление доступа к&nbsp;персональным данным
              каким-либо иным способом.
            </div>
            <div class="li">
              2.13. Трансграничная передача персональных данных&nbsp;— передача
              персональных данных на&nbsp;территорию иностранного государства
              органу власти иностранного государства, иностранному физическому
              или иностранному юридическому лицу.
            </div>
            <div class="li">
              2.14. Уничтожение персональных данных&nbsp;— любые действия,
              в&nbsp;результате которых персональные данные уничтожаются
              безвозвратно с&nbsp;невозможностью дальнейшего восстановления
              содержания персональных данных в&nbsp;информационной системе
              персональных данных и/или&nbsp;уничтожаются материальные носители
              персональных данных.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>3. Предмет соглашения</h5>
          <div class="ol">
            <div class="li">
              3.1. Предметом настоящего Соглашения является предоставление
              Пользователю Интернет-магазина доступа к содержащимся на Сайте
              Товарам и оказываемым услугам.
            </div>
            <div class="li">
              3.1.1. Интернет-магазин предоставляет Пользователю следующие виды
              услуг (сервисов): доступ к средствам поиска и навигации
              Интернет-магазина; доступ к информации о товаре и к информации о
              приобретении товара на платной основе; заказ товаров размещенных
              на сайте Интернет-магазина; доставка заказанных товаров к месту
              нахождения Пользователя; иные виды услуг (сервисов), реализуемые
              на страницах Интернет- магазина.
            </div>
            <div class="li">
              3.1.2. Под действие настоящего Соглашения подпадают все
              существующие (реально функционирующие) на данный момент услуги
              (сервисы) Интернет-магазина, а также любые их последующие
              модификации и появляющиеся в дальнейшем дополнительные услуги
              (сервисы) Интернет-магазина.
            </div>
            <div class="li">
              3.2. Доступ к Интернет-магазину предоставляется на бесплатной
              основе.
            </div>
            <div class="li">
              3.3. Настоящее Соглашение является публичной офертой. Получая
              доступ к Сайту, Пользователь считается присоединившимся к
              настоящему Соглашению.
            </div>
            <div class="li">
              3.4. Использование материалов и сервисов Сайта регулируется
              нормами действующего законодательства Российской Федерации.
            </div>
            <div class="li">
              3.5. Согласие с политикой Интернет-магазина и принятие настоящего
              соглашения подтверждается проставлением Пользователем знака «У» в
              соответствующем поле на странице регистрации сайта Интернет-
              магазина, напротив текста: «Согласен с политикой
              конфиденциальности и пользовательским соглашением» и означает, что
              все положения Соглашения ему ясны и понятны.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>4. Права и обязанности сторон</h5>
          <div class="ol">
            <div class="li">4.1. Администрация сайта вправе:</div>
            <div class="li">
              4.1.1. Изменять правила пользования Сайтом, а также изменять
              содержание данного Сайта. Изменения вступают в силу с момента
              публикации новой редакции Соглашения на Сайте.
            </div>
            <div class="li">
              4.1.2. Ограничить доступ к Сайту в случае нарушения Пользователем
              условий настоящего Соглашения.
            </div>
            <div class="li">4.2. Пользователь вправе:</div>
            <div class="li">4.2.1. Получить доступ к использованию Сайта</div>
            <div class="li">
              4.2.2. Пользоваться всеми имеющимися на Сайте услугами, а также
              приобретать любые Товары, предлагаемые на Сайте.
            </div>
            <div class="li">
              4.2.3. Задавать любые вопросы, относящиеся к услугам Интернет-
              магазина, путем направления письма на электронный почтовый ящик:
              гоз!ет!К19а@уапаех.ги.
            </div>
            <div class="li">
              4.2.4. Пользоваться Сайтом исключительно в целях и порядке,
              предусмотренных Соглашением и не запрещенных законодательством
              Российской Федерации.
            </div>
            <div class="li">4.3. Пользователь Сайта обязуется:</div>
            <div class="li">
              4.3.1. Предоставлять по запросу Администрации сайта дополнительную
              информацию, которая имеет непосредственное отношение к
              предоставляемым услугам данного Сайта.
            </div>
            <div class="li">
              4.3.2. Соблюдать имущественные и неимущественные права авторов и
              иных правообладателей при использовании Сайта.
            </div>
            <div class="li">
              4.3.3. Не предпринимать действий, которые могут рассматриваться
              как нарушающие нормальную работу Сайта.
            </div>
            <div class="li">
              4.3.4. Не распространять с использованием Сайта любую
              конфиденциальную и охраняемую законодательством Российской
              Федерации информацию о физических либо юридических лицах.
            </div>
            <div class="li">
              4.3.5. Избегать любых действий, в результате которых может быть
              нарушена конфиденциальность охраняемой законодательством
              Российской Федерации информации.
            </div>
            <div class="li">
              4.3.6. Не использовать Сайт для распространения информации
              рекламного характера, иначе как с согласия Администрации сайта.
            </div>
            <div class="li">
              4.3.7. Не использовать сервисы сайта Интернет-магазина с целью: -
              загрузки контента, который является незаконным, нарушает любые
              права третьих лиц; пропагандирует насилие, жестокость, ненависть и
              (или) дискриминацию по расовому, национальному, половому,
              религиозному, социальному признакам; содержит недостоверные
              сведения и (или) оскорбления в адрес конкретных лиц, организаций,
              органов власти.   - побуждения к совершению противоправных
              действий, а также содействия лицам, действия которых направлены на
              нарушение ограничений и запретов, действующих на территории
              Российской Федерации. - нарушения прав несовершеннолетних лиц и
              (или) причинение им вреда в любой форме. - ущемления прав
              меньшинств. - выдача себя за другого человека или представителя
              организации и (или) сообщества без достаточных на то прав, в том
              числе за сотрудников данного Интернет-магазина. - введения в
              заблуждение относительно свойств и характеристик какого- либо
              Товара из каталога Интернет-магазина, размещенного на Сайте. -
              некорректного сравнения Товара, а также формирования негативного
              отношения к лицам, (не) пользующимся определенными Товарами, или
              осуждения таких лиц.
            </div>
            <div class="li">4.4. Пользователю запрещается:</div>
            <div class="li">
              4.4.1. Использовать любые устройства, программы, процедуры,
              алгоритмы и методы, автоматические устройства или эквивалентные
              ручные процессы для доступа, приобретения, копирования или
              отслеживания содержания Сайта данного Интернет-магазина;
            </div>
            <div class="li">
              4.4.2. Нарушать надлежащее функционирование Сайта;
            </div>
            <div class="li">
              4.4.3. Любым способом обходить навигационную структуру Сайта для
              получения или попытки получения любой информации, документов или
              материалов любыми средствами, которые специально не представлены
              сервисами данного Сайта;
            </div>
            <div class="li">
              4.4.4. Несанкционированный доступ к функциям Сайта, любым другим
              системам или сетям, относящимся к данному Сайту, а также к любым
              услугам, предлагаемым на Сайте;
            </div>
            <div class="li">
              4.4.5. Нарушать систему безопасности или аутентификации на Сайте
              или в любой сети, относящейся к Сайту.
            </div>
            <div class="li">
              4.4.6. Выполнять обратный поиск, отслеживать или пытаться
              отслеживать любую информацию о любом другом Пользователе Сайта.
            </div>
            <div class="li">
              4.4.7. Использовать Сайт и его Содержание в любых целях,
              запрещенных законодательством Российской Федерации, а также
              подстрекать к любой незаконной деятельности или другой
              деятельности, нарушающей права интернет-магазина или других лиц.
            </div>
          </div>
        </div>
      </div>

      <div class="row mb-4">
        <div class="col">
          <h5>5. Использование сайта интернет-магазина</h5>
          <div class="ol">
            <div class="li">
              5.1. Сайт и Содержание, входящее в состав Сайта, принадлежит и
              управляется Администрацией сайта.
            </div>
            <div class="li">
              5.2. Содержание Сайта не может быть скопировано, опубликовано,
              воспроизведено, передано или распространено любым способом, а  
              также размещено в глобальной сети «Интернет» без предварительного
              письменного согласия Администрации сайта.
            </div>
            <div class="li">
              5.3. Содержание Сайта защищено авторским правом, законодательством
              о товарных знаках, а также другими правами, связанными с
              интеллектуальной собственностью, и законодательством о
              недобросовестной конкуренции.
            </div>
            <div class="li">
              5.4. Приобретение Товара, предлагаемого на Сайте, может
              потребовать создания учётной записи Пользователя.
            </div>
            <div class="li">
              5.5. Пользователь несет персональную ответственность за сохранение
              конфиденциальности информации учётной записи, включая пароль, а
              также за всю без исключения деятельность, которая ведётся от имени
              Пользователя учётной записи.
            </div>
            <div class="li">
              5.6. Пользователь должен незамедлительно уведомить Администрацию
              сайта о несанкционированном использовании его учётной записи или
              пароля, или любом другом нарушении системы безопасности.
            </div>
            <div class="li">
              5.7. Администрация сайта обладает правом в одностороннем порядке
              аннулировать учетную запись Пользователя, если она не
              использовалась более количество месяцев календарных месяцев подряд
              без уведомления Пользователя.
            </div>
            <div class="li">
              5.8 Настоящее Соглашение распространяет свое действия на все
              дополнительные положения и условия о покупке Товара и оказанию
              услуг, предоставляемых на Сайте.
            </div>
            <div class="li">
              5.9. Информация, размещаемая на Сайте не должна истолковываться
              как изменение настоящего Соглашения.
            </div>
            <div class="li">
              5.10. Администрация сайта имеет право в любое время без
              уведомления Пользователя вносить изменения в перечень Товаров и
              услуг, предлагаемых на Сайте, и (или) в цены, применимые к таким
              Товарам по их реализации и (или) оказываемым услугам
              Интернет-магазином.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>6. Ответственность</h5>
          <div class="ol">
            <div class="li">
              6.1. Любые убытки, которые Пользователь может понести в случае
              умышленного или неосторожного нарушения любого положения
              настоящего Соглашения, а также вследствие несанкционированного
              доступа к коммуникациям другого Пользователя, Администрацией сайта
              не возмещаются.
            </div>
            <div class="li">
              6.2.2. Действия систем переводов, банков, платежных систем и за
              задержки связанные с их работой.
            </div>
            <div class="li">
              6.2.3. Надлежащее функционирование Сайта, в случае, если
              Пользователь не имеет необходимых технических средств для его
              использования, а также не несет никаких обязательств по
              обеспечению пользователей такими средствами.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>7. Нарушение условий пользовательского соглашения</h5>
          <div class="ol">
            <div class="li">
              7.1. Администрация сайта вправе раскрыть любую собранную о
              Пользователе данного Сайта информацию, если раскрытие необходимо в
              связи с расследованием или жалобой в отношении неправомерного
              использования Сайта либо для установления (идентификации)
              Пользователя, который может нарушать или вмешиваться в права
              Администрации сайта или в права других Пользователей Сайта.
            </div>
            <div class="li">
              7.2. Администрация сайта имеет право раскрыть любую информацию о
              Пользователе, которую посчитает необходимой для выполнения
              положений действующего законодательства или судебных решений,
              обеспечения выполнения условий настоящего Соглашения, защиты прав
              или безопасности название организации, Пользователей.
            </div>
            <div class="li">
              7.3. Администрация сайта имеет право раскрыть информацию о
              Пользователе, если действующее законодательство Российской
              Федерации требует или разрешает такое раскрытие.
            </div>
            <div class="li">
              7.4. Администрация сайта вправе без предварительного уведомления
              Пользователя прекратить и (или) заблокировать доступ к Сайту, если
              Пользователь нарушил настоящее Соглашение или содержащиеся в иных
              документах условия пользования Сайтом, а также в случае
              прекращения действия Сайта либо по причине технической неполадки
              или проблемы.
            </div>
            <div class="li">
              7.5. Администрация сайта не несет ответственности перед
              Пользователем или третьими лицами за прекращение доступа к Сайту в
              случае нарушения Пользователем любого положения настоящего
              Соглашения или иного документа, содержащего условия пользования
              Сайтом.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>8. Рашрешение споров</h5>
          <div class="ol">
            <div class="li">
              8.1. В случае возникновения любых разногласий или споров между
              Сторонами настоящего Соглашения обязательным условием до обращения
              в суд является предъявление претензии (письменного предложения о
              добровольном урегулировании спора).
            </div>
            <div class="li">
              8.2. Получатель претензии в течение 30 календарных дней со дня ее
              получения, письменно уведомляет заявителя претензии о результатах
              рассмотрения претензии.
            </div>
            <div class="li">
              8.3. При невозможности разрешить спор в добровольном порядке любая
              из Сторон вправе обратиться в суд за защитой своих прав по месту
              нахождения собственника заведения
              {{ companyGroupRepo.item?.name }}.
            </div>
          </div>
        </div>
      </div>
      <div class="row mb-4">
        <div class="col">
          <h5>9. Дополнительные условия</h5>
          <div class="ol">
            <div class="li">
              9.1. Администрация сайта не принимает встречные предложения от
              Пользователя относительно изменений настоящего Пользовательского
              соглашения.
            </div>
            <div class="li">
              9.1. Администрация сайта не принимает встречные предложения от
              Пользователя относительно изменений настоящего Пользовательского
              соглашения.
            </div>
            <div class="li">
              9.2. Отзывы Пользователя, размещенные на Сайте, не являются
              конфиденциальной информацией и могут быть использованы
              Администрацией сайта без ограничений.
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div v-else class="absolute-center items-center justify-center flex">
    <q-spinner-puff color="accent1" size="20%" />
  </div>
</template>
<script lang="ts" setup>
import { authentication } from 'src/models/authentication/authentication'
// import { CompanyGroup } from 'src/models/companyGroup/companyGroup'
import { companyGroupRepo } from 'src/models/companyGroup/companyGroupRepo'
import { uiSettingsRepo } from 'src/models/uiSettings/uiSettingsRepo'
import { onMounted, ref } from 'vue'
import { useRoute } from 'vue-router'

const externalId = ref()

const route = useRoute()
const loader = ref(false)

// const linkToTerms = computed(() => {
//   return `https://${window.location.host}/${String(
//     route.params.externalId
//   )}/policy`
// })

onMounted(async () => {
  loader.value = true
  externalId.value = String(route.params.externalId)
  authentication.setCompanyGroupHeader(externalId.value)
  void companyGroupRepo.current()
  await uiSettingsRepo.fetchSettings(externalId.value)
  loader.value = false
})
</script>
